_Rarzrabotki/Kazna/Documents/СчетНаОплатуПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СчетНаОплатуПоставщика</Name>
			<BasedOn>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СчетаНал</xr:Item>
				<xr:Item>AccumulationRegister.ЛимитыПроектов</xr:Item>
				<xr:Item>AccumulationRegister.БДДС</xr:Item>
				<xr:Item>AccumulationRegister.ЛимитыНаМесяц</xr:Item>
				<xr:Item>AccumulationRegister.СчетаПоставщиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>(Общ) Банковский счет контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_ТекущаяРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_ТекущиеВизирующие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_ТекущиеВизирующие1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Визы_Состояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСчетНаОплатуПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКоммисии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетнаяСхемаВизирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыВизирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСпецификации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСпецификации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ФинАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Финагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ПроцентФинАгента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ДатаВозвратаФинАгента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Визы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Виза_Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Визы_Состояния</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авто</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТекущиеВизирующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредварительныеВизы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Утверждено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУтверждения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роли</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/ДоступностьСтатейДляПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ДоступностьСтатейДляПодразделений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/ДоступностьОрганизацийДляПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ДоступностьОрганизацийДляПодразделений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/СчетНаОплатуПоставщика/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ПриоритетнаяСхемаВизирования.Доступность=   РольДоступна("ВизированиеАдминистратор");
	Элементы.ПриоритетнаяСхемаВизирования.ТолькоПросмотр =НЕ  Элементы.ПриоритетнаяСхемаВизирования.Доступность;
	Элементы.СуммаКоммисии.Видимость = Объект.ВидОплаты = Перечисления.ВидыДенежныхСредств.Наличные;
	Попытка
		Элементы.ВидОперации.ТолькоПросмотр = НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Казначей"));
	Исключение
	КонецПопытки;
	ВидимостьКассы();
	ВидимостьФинАгента(); 
	ДоступностьСуммыКОплате();
КонецПроцедуры

&НаКлиенте
Процедура Виза_Команда(пКоманда)
	// Вставити вміст обробника.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(пОтказ, пСтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсиониованиеОбъектов   
	Если Объект.СуммаСчета=0 Тогда
		Объект.СуммаСчета=Объект.СуммаДокумента;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		лДопы = Новый Структура;
		лДопы.Вставить("Виза_Состояние", 		Перечисления.Визы_Состояния.Черновик);
		лДопы.Вставить("Автор", 				Пользователи.ТекущийПользователь());
		лДопы.Вставить("Ответственный", 		Пользователи.ТекущийПользователь());
		лДопы.Вставить("ДатаСоздания", 			ТекущаяДата());
		Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда 
			лДопы.Вставить("ВидОперации", 			Перечисления.ВидыОперацийСчетНаОплатуПоставщику.НаОплату);
		КонецЕсли;
		
		ЗаполнитьЕслиНеЗаполнено(лДопы );
	Иначе
		//++ Павел Чистяков 31.05.2016 12:26:21 
		// Временно закоментил согласно доработок от 31.05.2016
		// СтатьяДвиженияДенежныхСредствОграничениеСпискаВыбораПоПодразделениюНаСервере();
		//++ Павел Чистяков 31.05.2016 12:26:23 
	КонецЕсли;
	Виза_УстановитьДоступностьФормы();
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЕслиНеЗаполнено(пЗначения)
	Для Каждого лСтрока Из пЗначения Цикл
		Если 		Объект.Свойство(лСтрока.Ключ) 
			и НЕ 	ЗначениеЗаполнено( Объект[лСтрока.Ключ] ) тогда 
			Объект[лСтрока.Ключ] = лСтрока.Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере 
Процедура Виза_УстановитьДоступностьФормы()
	
	лДоступно = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр = Истина ИЛИ ЭтаФорма.Доступность = Ложь Тогда 
		Возврат ;//А чего проверять, наверное ограничение по дате или роли;)
	КонецЕсли;
	
	лПараметры	= Новый Структура("Ссылка, Ответственный, Автор, ТекущиеВизирующие, Виза_Состояние, ПредварительныеВизы");
	ЗаполнитьЗначенияСвойств(лПараметры, Объект);
	
	лДопы		= Новый Структура;	
	лДоступно	= Документы.СчетНаОплатуПоставщика.Виза_ДокументДоступен_НовыеСостояния(лПараметры,лДопы);
	
	лСкипатьЭлФормы = Неопределено;
	лСкипатьЭлФормы = ?(лДопы.Свойство("СкипатьЭлФормы",  лСкипатьЭлФормы), Новый Структура(лСкипатьЭлФормы), Новый Структура() );
	
	Для Каждого лЕлемент Из Элементы Цикл
		лТипОк 		= ТипЗнч(лЕлемент);
		
		Если лСкипатьЭлФормы.Свойство(лЕлемент.Имя) тогда 
			Продолжить;
		КонецЕсли;
		
		Если 	лТипОк = Тип("ПолеФормы")
			ИЛИ лТипОк = Тип("ТаблицаФормы") Тогда                                                         
		
			лЕлемент.ТолькоПросмотр = НЕ лДоступно;
		КонецЕсли;
	КонецЦикла;
	
	Виза_УстановитьКнопкиСостояния(лДопы.Состояния);  
	
КонецПроцедуры

&НаСервере 
Процедура Виза_УстановитьКнопкиСостояния(пСостояния)
	
	лГруппаКнопок = ЭтаФорма.Элементы.Кнопки_Виза;
	
	//лГруппаКнопок.Заголовок = ?(ЗначениеЗаполнено(Объект.Виза_ТекущаяРоль), Строка(Объект.Виза_ТекущаяРоль), "Виза"); 
	ЭтаФорма.Элементы.Кнопки_Виза_Заголовок.Заголовок = ?(ЗначениеЗаполнено(Объект.Виза_ТекущаяРоль), Строка(Объект.Виза_ТекущаяРоль), "Виза"); 
	
	Пока НЕ лГруппаКнопок.ПодчиненныеЭлементы.Количество() = 0 Цикл
		ЭтаФорма.Элементы.Удалить(лГруппаКнопок.ПодчиненныеЭлементы [0] );
	КонецЦикла;
	
	лСоотв_Знач_имя = Новый Соответствие();
	Для Каждого лСтрока Из Метаданные.Перечисления.Визы_Состояния.ЗначенияПеречисления Цикл
		лСоотв_Знач_имя.Вставить( Перечисления.Визы_Состояния[лСтрока.Имя], лСтрока.Имя);
	КонецЦикла;
	лСоотв_Знач_имя.Вставить(Перечисления.Визы_Состояния.ПустаяСсылка(), "ПустаяСсылка");

	лСотв_Картинок = Новый Соответствие();
	лСотв_Картинок.Вставить(Перечисления.Визы_Состояния.Отклонено, 		БиблиотекаКартинок.Ошибка32);
	лСотв_Картинок.Вставить(Перечисления.Визы_Состояния.Утвержден, 		БиблиотекаКартинок.Успешно32);
	лСотв_Картинок.Вставить(Перечисления.Визы_Состояния.УтвержденСКомментариями, БиблиотекаКартинок.Успешно32);
	лСотв_Картинок.Вставить(Перечисления.Визы_Состояния.УтвержденПоСхеме, БиблиотекаКартинок.Успешно32);
	лСотв_Картинок.Вставить(Перечисления.Визы_Состояния.Черновик , 		БиблиотекаКартинок.РедактироватьФайл);
	лСотв_Картинок.Вставить(Перечисления.Визы_Состояния.ОтложеноСКомментарием, 		БиблиотекаКартинок.РедактироватьФайл);
	лСотв_Картинок.Вставить(Перечисления.Визы_Состояния.ПустаяСсылка(), БиблиотекаКартинок.ВыполнитьРегламентноеЗаданиеВручную);
	
	//Анулировано
	//Черновик
	//НаВизировании
	
	лНом = 1;
	Для Каждого лСтрока Из пСостояния Цикл 
		лИмя 				= лСоотв_Знач_имя.Получить( лСтрока.Значение ); 
		лИмя				= "Виза_" +лИмя;
		
		Команда_НайтиСоздать(лИмя);
		
		лКнопка 			= ЭтаФорма.Элементы.Добавить( лИмя,  Тип("КнопкаФормы"), лГруппаКнопок);   
     	лКнопка.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
		лКнопка.ИмяКоманды 	= лИмя;
		лКнопка.Заголовок 	= лСтрока.Представление;
		
		лВремПерем			= лСотв_Картинок.Получить(лСтрока.Значение);
		Если НЕ лВремПерем = Неопределено Тогда 
			лКнопка.Картинка= лВремПерем;
			лКнопка.Отображение = ОтображениеКнопки.КартинкаИТекст; 
		КонецЕсли;
		
	КонецЦикла;            	
	
	лВидимость = НЕ ПустаяСтрока( Объект.Виза_Причина ); 
	Если НЕ Элементы.Виза_Причина.Видимость = лВидимость Тогда 
		Элементы.Виза_Причина.Видимость = лВидимость;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция Команда_НайтиСоздать(пИмя, пДействие = "Виза_Нажатие")
	лРезультат = ЭтаФорма.Команды.Найти(пИмя);
	Если лРезультат = Неопределено тогда 
		лРезультат	 		= ЭтаФорма.Команды.Добавить(пИмя);
		лРезультат.Действие = пДействие;
	КонецЕсли;
	
	Возврат лРезультат;
КонецФункции

&НаСервере
Функция Виза_ДокументДоступен(пПараметры, пРезультат = Неопределено)
	
	Возврат Документы.СчетНаОплатуПоставщика.Виза_ДокументДоступен_НовыеСостояния(пПараметры, пРезультат);
	
КонецФункции

&НаКлиенте
Процедура Виза_Нажатие(пКоманда)
	
	лИмя 	= пКоманда.Имя;
	лИмя	= Сред(лИмя, Найти(лИмя, "_") + 1);

	Виза_УстановитьСостояние( лИмя ) ;
	Виза_УстановитьДоступностьФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСостояниеПоИмени(пИмя)
	Возврат ?( ТипЗнч(пИмя)  = Тип("ПеречислениеСсылка.Визы_Состояния"), пИмя, Перечисления.Визы_Состояния[пИмя]);
КонецФункции

&НаКлиенте
Процедура УстановитьСостояниеУтвержденКомментарийПродолжить(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат<>Неопределено Тогда 
		Виза_УстановитьСостояние_Сервер("Утвержден", Новый Структура("ТЧ_Виза_Причина", Результат));
	КонецЕсли;
	Виза_УстановитьДоступностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеОтложеноКомментарийПродолжить(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат<>Неопределено Тогда 
		Виза_УстановитьСостояние_Сервер(Неопределено, Новый Структура("Виза_Причина", Результат));
	КонецЕсли;
	Виза_УстановитьДоступностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеУтвержденПоСхемеПродолжить(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат<>Неопределено Тогда 
		Виза_УстановитьСостояние_Сервер("Утвержден", Новый Структура("СхемаВизирования", Результат));
	КонецЕсли;
	Виза_УстановитьДоступностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура Виза_УстановитьСостояние(пСостояниеИмя)
	
	Если пСостояниеИмя = "Отклонено" Тогда 
		лПараметры = Новый Структура();
		лОповещение= Новый ОписаниеОповещения("Виза_УстановитьСостояние_Описание_Клиент",ЭтотОбъект,лПараметры);
	    ПоказатьВводСтроки(лОповещение, , "Укажите причину отказа", 0, Ложь);
	ИначеЕсли пСостояниеИмя = "УтвержденСКомментариями" Тогда 
	    ПоказатьВводСтроки(Новый ОписаниеОповещения("УстановитьСостояниеУтвержденКомментарийПродолжить",ЭтотОбъект),,
			"Укажите комментарий", 0, Ложь);
	ИначеЕсли пСостояниеИмя = "ОтложеноСКомментарием" Тогда 
	    ПоказатьВводСтроки(Новый ОписаниеОповещения("УстановитьСостояниеОтложеноКомментарийПродолжить",ЭтотОбъект),,
			"Укажите комментарий", 0, Ложь);
	ИначеЕсли пСостояниеИмя = "УтвержденПоСхеме" Тогда 
	    ПоказатьВводЗначения(Новый ОписаниеОповещения("УстановитьСостояниеУтвержденПоСхемеПродолжить",ЭтотОбъект),,
			"Укажите схему визирования", Тип("СправочникСсылка.СхемыВизирования"));
	Иначе
		Виза_УстановитьСостояние_Сервер(?(пСостояниеИмя = "ПустаяСсылка", "", пСостояниеИмя) );
		Виза_УстановитьДоступностьФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Виза_УстановитьСостояние_Описание_Клиент( пСтрока, пПараметры ) Экспорт 
	Если НЕ пСтрока = Неопределено Тогда 
		Виза_УстановитьСостояние_Сервер("Отклонено", Новый Структура("Виза_Причина", пСтрока));
	КонецЕсли;
	Виза_УстановитьДоступностьФормы();
КонецПроцедуры

&НаСервере
Процедура Виза_УстановитьСостояние_Сервер(пСостояниеИмя, пДопы = Неопределено) Экспорт 
	
	лСостояние 		= ?(ЗначениеЗаполнено(пСостояниеИмя), Перечисления.Визы_Состояния[пСостояниеИмя], Перечисления.Визы_Состояния.ПустаяСсылка());
	лДокОбъект		= РеквизитФормыВЗначение("Объект");
	
	лДопы = ?(пДопы = Неопределено, Новый Структура, пДопы );
	лДопы.Вставить("ТекущийПользователь", 	Пользователи.ТекущийПользователь());
	лДопы.Вставить("НовоеСостояние", 		лСостояние);
	лДопы.Вставить("ЭтоИзФормы", 			Истина);
	
	лДокОбъект.Виза_УстановитьСостояние(лСостояние, лДопы);
	
	ЗначениеВРеквизитФормы(лДокОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ВидОплатыПриИзменении(Элемент)
	УстановитьДоступностьОрганизации();
	УстановитьВидимость();
КонецПроцедуры

Процедура УстановитьДОступностьОрганизации()
	//ЭтаФорма.Элементы.Организация.Доступность= ПолучитьДоступностьОрганизаци();
	ЭтаФорма.Элементы.СчетКонтрагента.Доступность= ЭтаФорма.Элементы.Организация.Доступность;
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступностьОрганизаци()
	// Вставить содержимое обработчика.
	Если Объект.ВидОплаты=Перечисления.ВидыДенежныхСредств.Безналичные Тогда
		Возврат Истина;
	Иначе 
		Возврат ЛОжь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДОступностьОрганизации();
	ПодразделениеПриИзмененииНаСервере();
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОграничитьТипЗадачи();
	КонецЕсли; 
	
	УстановитьДоступностьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПодразделениеПриИзмененииНаСервере();
	ОграничитьТипЗадачи();
	СтатьяДвиженияДенежныхСредствОграничениеСпискаВыбораПоПодразделению();
КонецПроцедуры

&НаСервере
Процедура ОграничитьТипЗадачи()
	Если Объект.Подразделение.Родитель.Код="00-000001"
		ИЛИ Объект.Подразделение.Код="00-000001" Тогда
		Элементы.Задача.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Задачи");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере()
	ЭтаФорма.Элементы.ВидЗатрат.Видимость = Объект.Подразделение.ДетализацияДоВидаЗатрат;	
	//++ Павел Чистяков 10.10.2016 10:39:17 №312
	Справочники.Секции.ЗаполнитьСписокСекций(Элементы.Секция, Объект.Подразделение);
КонецПроцедуры

Функция ПолучитьСписокДоступныхПодразделений()
КонецФункции // ()

&НаКлиенте
Процедура СтатьяДвиженияДенежныхСредствОграничениеСпискаВыбораПоПодразделению()

	СтатьяДвиженияДенежныхСредствОграничениеСпискаВыбораПоПодразделениюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СтатьяДвиженияДенежныхСредствОграничениеСпискаВыбораПоПодразделениюНаСервере()

	//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	//Сава 2016/06 - на єтапе запуска - отключил  + "режим вібора из спика у елемента
	//Элементы.СтатьяДвиженияДенежныхСредств.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокДоступныхСДДС(Объект.Подразделение));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДоступныхСДДС(Подразделение)
	
	СписокЗначений	= Новый Массив;
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат СписокЗначений;
	КонецЕсли;
	
	Запрос	= Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Подразделение);	
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	ДоступностьСтатейДляПодразделений.СтатьяДвиженияДенежныхСредств
	            	  |ИЗ
	            	  |	РегистрСведений.ДоступностьСтатейДляПодразделений КАК ДоступностьСтатейДляПодразделений
	            	  |ГДЕ
	            	  |	ДоступностьСтатейДляПодразделений.Подразделение = &Подразделение";
	РезультатЗапроса	= Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		СписокЗначений.Добавить(РезультатЗапроса.СтатьяДвиженияДенежныхСредств);					  
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.ПлановаяДатаОплаты = Объект.Дата; 
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОчиститьРегистрФактОтправкиУведомленийОСчетахНаВизировании();
	
	ОтправитьУведомленияОСостоянииДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьРегистрФактОтправкиУведомленийОСчетахНаВизировании()
	
	Если Объект.Виза_Состояние	= Перечисления.Визы_Состояния.Черновик
		Или Объект.Виза_Состояние	= Перечисления.Визы_Состояния.Отклонено Тогда
		АХ_ОбщегоНазначения.ОчиститьРегистрФактОтправкиУведомленийОСчетахНаВизировании(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьУведомленияОСостоянииДокумента()
	
	Если Объект.Виза_Состояние	= Перечисления.Визы_Состояния.Отклонено Тогда
		АХ_ОбщегоНазначения.ОтправитьУведомлениеАвторуОбОтменеСчета(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПредВиза_НажатиеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПредВиза_Нажатие(Команда)
	ПредВиза_НажатиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СчетаОснованияСчетПриИзменении(Элемент)
	СчетаОснованияСчетПриИзмененииНаСервере(Элементы.СчетаОснования.ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры

&НаСервере
Процедура СчетаОснованияСчетПриИзмененииНаСервере(Идентификатор)
	Документы.СчетНаОплатуПоставщика.ОбновитьСтрокуСчетаОснования(Объект, Объект.СчетаОснования[Идентификатор]);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПерезаполнитьТекущиеВизирующие();
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТекущиеВизирующие()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьТекущиеВизирующие(Объект.Виза_ТекущаяРоль);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура НомерВходящегоДокументаПриИзменении(Элемент)
	ОбновитьНазначениеПлатежа();
КонецПроцедуры                  

Процедура ОбновитьНазначениеПлатежа()
	Объект.НазначениеПлатежа="Оплата згідно Договору "+Объект.ДоговорКонтрагента.Номер+" від "+Формат(Объект.ДоговорКонтрагента.Дата,"ДФ=dd.MM.yyyy");	
		Если ЗначениеЗаполнено(Объект.ДатаСпецификации) Тогда
	Объект.НазначениеПлатежа=Объект.НазначениеПлатежа+", Специфікації № "+Объект.НомерСпецификации+" від "+ Формат( Объект.ДатаСпецификации,"ДФ=dd.MM.yyyy");
			
		КонецЕсли;
		Объект.НазначениеПлатежа=Объект.НазначениеПлатежа+", Рахунок № "+ Объект.НомерВходящегоДокумента+" від "+ Формат( Объект.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy");
		Если Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
			Объект.НазначениеПлатежа=Объект.НазначениеПлатежа+" З ПДВ";
		Иначе
			Объект.НазначениеПлатежа=Объект.НазначениеПлатежа+" БЕЗ ПДВ";
		КонецЕсли;
	
		Если Значениезаполнено(Объект.ДоговорКонтрагента) Тогда 
			Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента.ОбщаяСуммаДоговора) Тогда  
				Объект.СуммаСчета = Объект.ДоговорКонтрагента.ОбщаяСуммаДоговора;
			КонецЕсли; 
			
			Объект.СтатьяДвиженияДенежныхСредств = Объект.ДоговорКонтрагента.СтатьяДДС;
		КонецЕсли;     
		
		
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВходящегоДокументаПриИзменении(Элемент)
	ОбновитьНазначениеПлатежа();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ОбновитьНазначениеПлатежа();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	ОбновитьНазначениеПлатежа();  
	УстановитьДоступностьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ДатаСпецификацииПриИзменении(Элемент)
	ОбновитьНазначениеПлатежа();
КонецПроцедуры

&НаКлиенте
Процедура НомерСпецификацииПриИзменении(Элемент)
	ОбновитьНазначениеПлатежа();
КонецПроцедуры

&НаСервере
Процедура ПроцентОплатыПриИзмененииНаСервере()
	Объект.СуммаДокумента=Окр(Объект.СуммаСчета *(Объект.ПроцентОплаты/100),2);
КонецПроцедуры

&НаКлиенте
Процедура ПроцентОплатыПриИзменении(Элемент)
	ПроцентОплатыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОпределитьПРоцентОплаты()
	//Определить % оплаты 
	Объект.ПроцентОплаты=РегистрыСведений.ПараметрыОплатыСчетов.ПолучитьПроцентОплаты(Объект.Контрагент,Объект.СтатьяДвиженияДенежныхСредств);
	Если Объект.СуммаДокумента<=10000 Тогда
		Объект.ПроцентОплаты=100;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаСчетаПриИзменении(Элемент)
	ОпределитьПРоцентОплаты();           
	ПроцентОплатыПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДвиженияДенежныхСредствПриИзменении(Элемент)
	ОпределитьПРоцентОплаты();          
	ПроцентОплатыПриИзмененииНаСервере();  
	//Тютюн 
	ВидимостьФинАгента();
	//КОнецИзменений
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОпределитьПРоцентОплаты(); 
	ПроцентОплатыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика  
	Если ЗначениеЗаполнено(ТекущийОбъект.ДоговорКонтрагента) И ТекущийОбъект.СуммаДокумента>10000 Тогда   
		Если ЗначениеЗаполнено(ТекущийОбъект.Дата) Тогда
			//ДатаКонтроля = Новый Граница(ТекущийОбъект.моментВремени(),ВидГраницы.Исключая);
			ДатаКонтроля = ТекущийОбъект.Дата;
		Иначе
			ДатаКонтроля = ТекущаяДата();
		КонецЕсли;
		СуммаСчетов = Справочники.ДоговорыКонтрагентов.ПолучитьСуммуСчетовПоДоговору(ТекущийОбъект.ДоговорКонтрагента,ДатаКонтроля);
		Если ТекущийОбъект.СуммаДокумента >(ТекущийОбъект.ДоговорКонтрагента.ОбщаяСуммаДоговора-СуммаСчетов) Тогда
			
			//Отказ= Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Сумма счета ="+ТекущийОбъект.СуммаДокумента+", по договору = "+ТекущийОбъект.ДоговорКонтрагента.ОбщаяСуммаДоговора+", использовано = "+СуммаСчетов,,,,Отказ);
		КонецЕсли;	
		
	КонецЕсли;  
	
			
КонецПроцедуры
 //Тютюн 20.02.25
&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьНаСервере()
КонецПроцедуры     

Процедура ПроверитьНаСервере() 
	Если Значениезаполнено(Объект.Ссылка) Тогда 
		BAS = ВыполнитьПодключениеКИБПриемнику();  
		ВыбратьДанные(BAS)  
	Иначе
		Сообщить("Запишіть документ!");
	КонецЕсли;

КонецПроцедуры     

Функция ВыполнитьПодключениеКИБПриемнику() Экспорт
	
	РезультатПодключения = Неопределено;
	
	СтруктураПодключения = Новый Структура();
	СтруктураПодключения.Вставить("ИмяСервера", "127.0.0.1");  
	Если Объект.Организация.ЕГРПОУ = "44784098" Тогда  
		ИмяИБ = "bas_trans";   
		ПользовательИБ = "1cAdmin";	
	ИначеЕсли  Объект.Организация.ЕГРПОУ = "43698485" Тогда    
		ИмяИБ = "bas_dolyna";   
		ПользовательИБ = "Админ";
	Иначе
		ИмяИБ = "bas_industrialbud"; 
		ПользовательИБ = "1cAdmin";
	КонецЕсли; 
	СтруктураПодключения.Вставить("ИмяИБНаСервере", ИмяИБ);
	СтруктураПодключения.Вставить("Пользователь", ПользовательИБ);
	СтруктураПодключения.Вставить("Пароль", "248842");
	//СтруктураПодключения.Вставить("ВерсияПлатформы", ВерсияПлатформыИнформационнойБазыДляПодключения);
	
	ОбъектПодключения = ПодключитсяКИнформационнойБазе(СтруктураПодключения);
	
	Если ОбъектПодключения = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ОбъектПодключения;
	КонецЕсли;
	
		
КонецФункции

Функция ПодключитсяКИнформационнойБазе(СтруктураПодключения, СтрокаСообщенияОбОшибке = "")
	
	Перем СтрокаПодключения;
	
	ПараметровДостаточно = ОпределитьДостаточностьПараметровДляПодключенияКИнформационнойБазе(СтруктураПодключения, СтрокаПодключения, СтрокаСообщенияОбОшибке);
	
	Если Не ПараметровДостаточно Тогда
		Возврат Неопределено;
	КонецЕсли;
	
		Если НЕ ПустаяСтрока(СтруктураПодключения.Пользователь) Тогда
			СтрокаПодключения = СтрокаПодключения + ";Usr = """ + СтруктураПодключения.Пользователь + """";
		КонецЕсли;
		Если НЕ ПустаяСтрока(СтруктураПодключения.Пароль) Тогда
			СтрокаПодключения = СтрокаПодключения + ";Pwd = """ + СтруктураПодключения.Пароль + """";
		КонецЕсли;
	
	//"V8" или "V81"
	ОбъектПодключения = "V83";
	
	СтрокаПодключения = СтрокаПодключения + ";";
	
	Попытка
		
		#Если Клиент Тогда
		Состояние(НСтр("ru='Идет процесс соединения ...';uk=""Іде процес з'єднання ..."""));
		#КонецЕсли
	
		ОбъектПодключения = ОбъектПодключения +".COMConnector";
		ТекCOMПодключение = Новый COMОбъект(ОбъектПодключения);
		ТекCOMОбъект = ТекCOMПодключение.Connect(СтрокаПодключения);
					
		#Если Клиент Тогда
		Состояние(НСтр("ru='Соединение установлено';uk=""З'єднання встановлене"""));
		#КонецЕсли		
			
	Исключение
		
		СтрокаСообщенияОбОшибке = НСтр("ru='При попытке соединения с COM-сервером произошла следующая ошибка:';uk="" При спробі з'єднання з Com-сервером відбулася наступна помилка:""") + Символы.ПС 
						+ ОписаниеОшибки();
		
		Сообщить(СтрокаСообщенияОбОшибке);
		
		#Если Клиент Тогда
		Состояние(НСтр("ru='Соединение установить не удалось';uk=""З'єднання встановити не вдалося"""));
		Состояние();
		#КонецЕсли
							
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат ТекCOMОбъект;
	
КонецФункции

Функция ОпределитьДостаточностьПараметровДляПодключенияКИнформационнойБазе(СтруктураПодключения, СтрокаПодключения = "", СтрокаСообщенияОбОшибке = "")
	
	НаличиеОшибок = Ложь;
	
		
	Если ПустаяСтрока(СтруктураПодключения.ИмяСервера) Тогда
			
			СтрокаСообщенияОбОшибке = НСтр("'ru  = Не задано имя сервера 1С:Предприятия информационной базы-приемника'");
			
			Сообщить(СтрокаСообщенияОбОшибке);
			
			НаличиеОшибок = Истина;
			
		КонецЕсли;
		
		Если ПустаяСтрока(СтруктураПодключения.ИмяИБНаСервере) Тогда
			
			СтрокаСообщенияОбОшибке = НСтр("'ru = Не задано имя информационной базы-приемника на сервере 1С:Предприятия'");
			
			Сообщить(СтрокаСообщенияОбОшибке);
			
			НаличиеОшибок = Истина;
			
		КонецЕсли;		
		
		СтрокаПодключения = "Srvr = """ + СтруктураПодключения.ИмяСервера + """; Ref = """ + СтруктураПодключения.ИмяИБНаСервере + """";	
	
	Возврат НЕ НаличиеОшибок;	
	
КонецФункции


Процедура ВыбратьДанные(BAS)  
	
Попытка	
	Запрос = BAS.NewObject("Запрос");
	Запрос.Текст = "ВЫБРАТЬ
|	ВЫБОР
|		КОГДА ЕСТЬNULL(СчетНаОплатуПоставщика.Ссылка, 0) = 0
|			ТОГДА ЛОЖЬ
|		ИНАЧЕ ИСТИНА
|	КОНЕЦ КАК ЕстьСчет,
|	ЕСТЬNULL(Остатки631.СуммаОстатокДт, 0) КАК ОстатокДт,
|	ЕСТЬNULL(Остатки631.СуммаОстатокКт, 0) КАК ОстатокКт,
|	ЕСТЬNULL(ВложенныйЗапрос.СуммаДокумента, 0) КАК НН
|ИЗ
|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками), , ) КАК Остатки631
|		ПО (Остатки631.Субконто3 = СчетНаОплатуПоставщика.Ссылка),
|	(ВЫБРАТЬ
|		СУММА(РегистрацияВходящегоНалоговогоДокумента.СуммаДокумента) КАК СуммаДокумента
|	ИЗ
|		Документ.РегистрацияВходящегоНалоговогоДокумента КАК РегистрацияВходящегоНалоговогоДокумента
|	ГДЕ
|		РегистрацияВходящегоНалоговогоДокумента.Проведен
|		И РегистрацияВходящегоНалоговогоДокумента.Сделка.ДатаВходящегоДокумента = &Дата
|		И РегистрацияВходящегоНалоговогоДокумента.Сделка.НомерВходящегоДокумента = &Номер
|		И РегистрацияВходящегоНалоговогоДокумента.Сделка.Контрагент.КодПоЕДРПОУ = &ЕДРПОУКонтрагента
|		И РегистрацияВходящегоНалоговогоДокумента.Сделка.Организация.КодПоЕДРПОУ = &ЕДРПОУОрганизации) КАК ВложенныйЗапрос
|ГДЕ
|	СчетНаОплатуПоставщика.НомерВходящегоДокумента = &Номер
|	И СчетНаОплатуПоставщика.ДатаВходящегоДокумента = &Дата
|	И СчетНаОплатуПоставщика.Контрагент.КодПоЕДРПОУ = &ЕДРПОУКонтрагента
|	И СчетНаОплатуПоставщика.Организация.КодПоЕДРПОУ = &ЕДРПОУОрганизации
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЕСТЬNULL(ОтправкаПолучениеДокументов.ДокументыПолучены, ЛОЖЬ) КАК Оригинал,
|	ПоступлениеТоваровУслуг.Дата КАК Дата,
|	ПоступлениеТоваровУслуг.Номер КАК Номер,
|	ЕСТЬNULL(ПоступлениеТоваровУслуг.СуммаДокумента, 0) КАК Сумма
|ИЗ
|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтправкаПолучениеДокументов КАК ОтправкаПолучениеДокументов
|		ПО ПоступлениеТоваровУслуг.Ссылка = ОтправкаПолучениеДокументов.Документ
|ГДЕ
|	ПоступлениеТоваровУслуг.Сделка.ДатаВходящегоДокумента = &Дата
|	И ПоступлениеТоваровУслуг.Сделка.НомерВходящегоДокумента = &Номер
|	И ПоступлениеТоваровУслуг.Сделка.Контрагент.КодПоЕДРПОУ = &ЕДРПОУКонтрагента
|	И ПоступлениеТоваровУслуг.Сделка.Организация.КодПоЕДРПОУ = &ЕДРПОУОрганизации
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ЕСТЬNULL(ОтправкаПолучениеДокументов.ДокументыПолучены, ЛОЖЬ),
|	ПоступлениеДопРасходов.Дата,
|	""ДВитр. "" + ПоступлениеДопРасходов.Номер,
|	ЕСТЬNULL(ПоступлениеДопРасходов.СуммаДокумента, 0)
|ИЗ
|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтправкаПолучениеДокументов КАК ОтправкаПолучениеДокументов
|		ПО ПоступлениеДопРасходов.Ссылка = ОтправкаПолучениеДокументов.Документ
|ГДЕ
|	ПоступлениеДопРасходов.Сделка.ДатаВходящегоДокумента = &Дата
|	И ПоступлениеДопРасходов.Сделка.НомерВходящегоДокумента = &Номер
|	И ПоступлениеДопРасходов.Сделка.Контрагент.КодПоЕДРПОУ = &ЕДРПОУКонтрагента
|	И ПоступлениеДопРасходов.Сделка.Организация.КодПоЕДРПОУ = &ЕДРПОУОрганизации";  
	
	  Запрос.УстановитьПараметр("Номер",  Объект.НомерВходящегоДокумента);  
	  Запрос.УстановитьПараметр("Дата", Объект.ДатаВходящегоДокумента);  
	  Запрос.УстановитьПараметр("ЕДРПОУКонтрагента", Объект.Контрагент.ЕГРПОУ);  
	  Запрос.УстановитьПараметр("ЕДРПОУОрганизации", Объект.Организация.ЕГРПОУ);  
      РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	  Выборка = РезультатЗапроса.Получить(0).Выгрузить();
	  ВыводитьМакет = Ложь;  
	  Табдок.Очистить();
	  Для Каждого Строка из Выборка Цикл   
		  ВыводитьМакет = Истина;
		  Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СчетНаОплатуПоставщика.Макет"); 
		  ОбластьМакета = Макет.ПолучитьОбласть("Шапка");  
		  ОбластьМакета.Параметры.Дт631 = Строка.ОстатокДт;
		  ОбластьМакета.Параметры.Кт631 = Строка.ОстатокКт; 
		  ОбластьМакета.Параметры.НН = Строка.НН;  
		  ТабДок.Вывести(ОбластьМакета);

		  
	  КонецЦикла;
	  
	  Выборка =  РезультатЗапроса.Получить(1).Выгрузить();  
	  
	  Если ВыводитьМакет Тогда 
		  Элементы.ТабДок.Видимость = Истина;
		  ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
		  ТабДок.Вывести(ОбластьМакета); 
	  Иначе
		   Сообщить(" В BAS не знайдено документ №" + Объект.НомерВходящегоДокумента + "Від "+ Объект.ДатаВходящегоДокумента + " по контрагенту з ЄДРПОУ " + Объект.Контрагент.ЕГРПОУ );
	  КонецЕсли;
	  
	  Если ВыводитьМакет Тогда
	  ИтогоСумма = 0;  
	  Для Каждого Строка из Выборка Цикл  
		  ОбластьМакета = Макет.ПолучитьОбласть("Строка"); 
		  ОбластьМакета.Параметры.Заполнить(Строка);
		  ТабДок.Вывести(ОбластьМакета); 
		  ИтогоСумма = ИтогоСумма + Строка.Сумма;
		  
	  КонецЦикла;     
	  ОбластьМакета = Макет.ПолучитьОбласть("Подвал"); 
	  ОбластьМакета.Параметры.ИтогоСумма = ИтогоСумма; 
	  ТабДок.Вывести(ОбластьМакета);  
	  КонецЕсли;
        
  Исключение
	  
        Сообщить("Ошибка при выполнении запроса к удаленной БД: " + ОписаниеОшибки());    
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоКонтрагенту(Команда)
	ДанныеНаСервере();
КонецПроцедуры     

Процедура ДанныеНаСервере() 
	Если Значениезаполнено(Объект.Ссылка) Тогда 
		BAS = ВыполнитьПодключениеКИБПриемнику();  
		ВыбратьДанныеКонтрагента(BAS)  
	Иначе
		Сообщить("Запишіть документ!");
	КонецЕсли;

КонецПроцедуры     

Процедура ВыбратьДанныеКонтрагента(BAS)  
	
	Попытка	
		Запрос = BAS.NewObject("Запрос");
		Запрос.Текст =" 
		//"ВЫБРАТЬ
		//|	ВложенныйЗапрос.Долг КАК Сумма,
		//|	ВложенныйЗапрос.Номер КАК Номер,
		//|	ВложенныйЗапрос.Дата КАК Дата,
		//|   Ложь КАК Оригинал
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		ХозрасчетныйОстатки.СуммаОстатокКт КАК Долг,
		//|		ЕСТЬNULL(ОтправкаПолучениеДокументов.ДокументыПолучены, ЛОЖЬ) КАК ДокументыПолучены,
		//|		ХозрасчетныйОстатки.Субконто3.Номер КАК Номер,
		//|		ХозрасчетныйОстатки.Субконто3.Дата КАК Дата
		//|	ИЗ
		//|		РегистрБухгалтерии.Хозрасчетный.Остатки(
		//|				,
		//|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками),
		//|				,
		//|				Субконто1.КодПоЕДРПОУ = &ЕДРПОУКонтрагента
		//|					И Организация.КодПоЕДРПОУ = &ЕДРПОУОрганизации) КАК ХозрасчетныйОстатки
		//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтправкаПолучениеДокументов КАК ОтправкаПолучениеДокументов
		//|			ПО ХозрасчетныйОстатки.Субконто3 = ОтправкаПолучениеДокументов.Документ) КАК ВложенныйЗапрос
		//|ГДЕ
		//|	НЕ ВложенныйЗапрос.ДокументыПолучены    
		|		ВЫБРАТЬ
		|	ВложенныйЗапрос.Номер КАК Номер,
		|	ВложенныйЗапрос.Дата КАК Дата,
		|	ВложенныйЗапрос.Сумма КАК Сумма,
		|	ЛОЖЬ КАК Поле1
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПоступлениеТоваровУслуг.Номер КАК Номер,
		|		ПоступлениеТоваровУслуг.Дата КАК Дата,
		|		ПоступлениеТоваровУслуг.СуммаДокумента КАК Сумма,
		|		ЕСТЬNULL(ОтправкаПолучениеДокументов.ДокументыПолучены, ЛОЖЬ) КАК ДокументыПолучены
		|	ИЗ
		|		Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтправкаПолучениеДокументов КАК ОтправкаПолучениеДокументов
		|			ПО ПоступлениеТоваровУслуг.Ссылка = ОтправкаПолучениеДокументов.Документ
		|	ГДЕ
		|		ПоступлениеТоваровУслуг.Контрагент.КодПоЕДРПОУ = &ЕДРПОУКонтрагента
		|		И ПоступлениеТоваровУслуг.Проведен
		|		И ПоступлениеТоваровУслуг.Организация.КодПоЕДРПОУ = &ЕДРПОУОрганизации
		|		И ПоступлениеТоваровУслуг.ДоговорКонтрагента.Направление.Код = &КодНаправления
		|		И ПоступлениеТоваровУслуг.ДоговорКонтрагента.Подразделение.Код = &КодПодразделения
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПоступлениеДопРасходов.Номер,
		|		ПоступлениеДопРасходов.Дата,
		|		ПоступлениеДопРасходов.СуммаДокумента,
		|		ЕСТЬNULL(ОтправкаПолучениеДокументов.ДокументыПолучены, ЛОЖЬ)
		|	ИЗ
		|		Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтправкаПолучениеДокументов КАК ОтправкаПолучениеДокументов
		|			ПО ПоступлениеДопРасходов.Ссылка = ОтправкаПолучениеДокументов.Документ
		|	ГДЕ
		|		ПоступлениеДопРасходов.Контрагент.КодПоЕДРПОУ = &ЕДРПОУКонтрагента
		|		И ПоступлениеДопРасходов.Проведен
		|		И ПоступлениеДопРасходов.Организация.КодПоЕДРПОУ = &ЕДРПОУОрганизации
		|		И ПоступлениеДопРасходов.ДоговорКонтрагента.Подразделение.Код = &КодПодразделения
		|		И ПоступлениеДопРасходов.ДоговорКонтрагента.Направление.Код = &КодНаправления) КАК ВложенныйЗапрос
		|ГДЕ
		|	НЕ ВложенныйЗапрос.ДокументыПолучены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.СуммаОстатокДт КАК ОстатокДт
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалоговыйКредитНеподтвержденный),
		|			,
		|			Субконто1.КодПоЕДРПОУ = &ЕДРПОУКонтрагента
		|				И Организация.КодПоЕДРПОУ = &ЕДРПОУОрганизации
		|				И Субконто2.Направление.Код = &КодНаправления
		|				И Субконто2.Подразделение.Код = &КодПодразделения) КАК ХозрасчетныйОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.СуммаОстатокКт КАК ОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками),
		|			,
		|			Субконто1.КодПоЕДРПОУ = &ЕДРПОУКонтрагента
		|				И Организация.КодПоЕДРПОУ = &ЕДРПОУОрганизации
		|				И Субконто2.Направление.Код = &КодНаправления
		|				И Субконто2.Подразделение.Код = &КодПодразделения) КАК ХозрасчетныйОстатки";  
		
		Запрос.УстановитьПараметр("ЕДРПОУКонтрагента", Объект.Контрагент.ЕГРПОУ);  
		Запрос.УстановитьПараметр("ЕДРПОУОрганизации", Объект.Организация.ЕГРПОУ); 
		Запрос.УстановитьПараметр("КодНаправления", Объект.Направление.Код); 
		Запрос.УстановитьПараметр("КодПодразделения", Объект.Подразделение.Код); 
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Табдок.Очистить();    
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СчетНаОплатуПоставщика.Макет");  
		Выборка = РезультатЗапроса.Получить(1).Выгрузить();

		Для Каждого Строка из Выборка Цикл   
			 
			ОбластьМакета = Макет.ПолучитьОбласть("НДС");  
			ОбластьМакета.Параметры.ОстатокДт = Строка.ОстатокДт;
			ТабДок.Вывести(ОбластьМакета);
		КонецЦикла;
		
		Выборка =  РезультатЗапроса.Получить(0).Выгрузить();  
		
		Элементы.ТабДок.Видимость = Истина;
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
		ТабДок.Вывести(ОбластьМакета); 
		
		ИтогоСумма = 0;  
		Для Каждого Строка из Выборка Цикл  
			ОбластьМакета = Макет.ПолучитьОбласть("Строка"); 
			ОбластьМакета.Параметры.Заполнить(Строка);
			ТабДок.Вывести(ОбластьМакета); 
			ИтогоСумма = ИтогоСумма + Строка.Сумма;
			
		КонецЦикла;     
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал"); 
		ОбластьМакета.Параметры.ИтогоСумма = ИтогоСумма; 
		ТабДок.Вывести(ОбластьМакета); 
		
		
		Выборка = РезультатЗапроса.Получить(2).Выгрузить(); 
		Остаток63 = 0;
		Для Каждого Строка из Выборка Цикл   
			Остаток63 = Строка.ОстатокКт+ Остаток63;
		КонецЦикла; 
		
		ОбластьМакета = Макет.ПолучитьОбласть("Остатки"); 
        ОбластьМакета.Параметры.ОстатокКт =Остаток63; 
		ОбластьМакета.Параметры.ОстатокМинус = Остаток63 - ИтогоСумма;
		ТабДок.Вывести(ОбластьМакета);

		
	Исключение
		
		Сообщить("Ошибка при выполнении запроса к удаленной БД: " + ОписаниеОшибки());    
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПроверитьНаличиеДокументов()     
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПоставщика.Ссылка,
	|	СчетНаОплатуПоставщика.ПроцентОплаты
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
	|ГДЕ
	|	НЕ СчетНаОплатуПоставщика.ПометкаУдаления
	|	И СчетНаОплатуПоставщика.Проведен
	|	И СчетНаОплатуПоставщика.НомерВходящегоДокумента ПОДОБНО &НомерВходящегоДокумента
	|	И СчетНаОплатуПоставщика.Контрагент = &Контрагент
	|	И СчетНаОплатуПоставщика.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ СчетНаОплатуПоставщика.Ссылка = &ТекущийДокумент
	|	И СчетНаОплатуПоставщика.Организация = &Организация";
	Запрос.УстановитьПараметр("НомерВходящегоДокумента",  Объект.НомерВходящегоДокумента);  
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецГода(Объект.Дата)); 
	Запрос.УстановитьПараметр("ТекущийДокумент", Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ОбщийПроцентОплаты = Объект.ПроцентОплаты;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл    
		ОбщийПроцентОплаты = ОбщийПроцентОплаты + ВыборкаДетальныеЗаписи.ПроцентОплаты;
	КонецЦикла; 
	
	Если  ОбщийПроцентОплаты > 100 Тогда  
		Сообщить("Превышен общий процент оплаты по входящему документу №"+Объект.НомерВходящегоДокумента +", текущий документ не записан!");
		Возврат ИСТИНА;
	Иначе 
			Возврат ЛОЖЬ;
	КонецЕсли;	
	
КонецФункции	


&НаСервере
Функция ПроверитьНаличиеЗавизированныхДокументов()
	
	//Если Объект.ПроцентОплаты<=50 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПоставщика.Ссылка,
		|	СчетНаОплатуПоставщика.ПроцентОплаты,
		|	СчетНаОплатуПоставщика.Виза_Состояние
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
		|ГДЕ
		|	НЕ СчетНаОплатуПоставщика.ПометкаУдаления
		|	И СчетНаОплатуПоставщика.Проведен
		|	И СчетНаОплатуПоставщика.НомерВходящегоДокумента ПОДОБНО &НомерВходящегоДокумента
		|	И СчетНаОплатуПоставщика.Контрагент = &Контрагент
		|	И СчетНаОплатуПоставщика.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ СчетНаОплатуПоставщика.Ссылка = &ТекущийДокумент
		|	И СчетНаОплатуПоставщика.Организация = &Организация
		|	И СчетНаОплатуПоставщика.Виза_Состояние = &Виза_Состояние";
		ДатаДокумента = Объект.Дата;
		Запрос.УстановитьПараметр("НомерВходящегоДокумента",  Объект.НомерВходящегоДокумента);  
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(ДатаДокумента));
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаДокумента); 
		Запрос.УстановитьПараметр("ТекущийДокумент", Объект.Ссылка);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);  
		Запрос.УстановитьПараметр("Виза_Состояние", Перечисления.Визы_Состояния.Утвержден);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ОбщийПроцентОплаты = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл    
			ОбщийПроцентОплаты = ОбщийПроцентОплаты + ВыборкаДетальныеЗаписи.ПроцентОплаты;
		КонецЦикла; 
		
		Если  ОбщийПроцентОплаты > 0 Тогда  
			Возврат ИСТИНА;
			
		КонецЕсли;	
		
	//КонецЕсли;
	
	Возврат ЛОЖЬ;

КонецФункции  

&НаКлиенте
Процедура ЗадатьВопрос()
    
    ТекстВопроса = "Для даного документа доступна упрощенная схема визирования!"+Символы.ПС+Символы.ПС+"Инициатор->Казначей"+Символы.ПС+Символы.ПС+"Установить упрощенную схему визирования?";
    
    ПоказатьВопрос(
        Новый ОписаниеОповещения("ОбработкаОтвета", ЭтотОбъект),
        ТекстВопроса,
        РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да, // значение по умолчанию
        "Подтверждение" // заголовок окна
    );
КонецПроцедуры
 &НаКлиенте
 Процедура ОбработкаОтвета(Результат, ДополнительныеПараметры) Экспорт
	 Если Результат = КодВозвратаДиалога.Да Тогда
	     УстановитьУпрощеннуюСхемуВизирования();
	     УдалосьЗаписать = ЭтотОбъект.Записать(Новый Структура("НеЗадаватьВопрос",Истина));  
	 ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
	     ЭтотОбъект.Записать(Новый Структура("НеЗадаватьВопрос",Истина));
	 Иначе
	     Сообщить("Диалог был закрыт без выбора.");
	 КонецЕсли;
 КонецПроцедуры    
 
 &НаСервере
 Процедура УстановитьУпрощеннуюСхемуВизирования();
	 Объект.Визы.Очистить();
	 СтПараметров = Новый Структура;  
	 СтПараметров.Вставить("СхемаВизирования", Справочники.СхемыВизирования.НайтиПоКоду("000000062"));
	 Виза_УстановитьСостояние_Сервер("Утвержден", СтПараметров);  
	  Виза_УстановитьДоступностьФормы();
 КонецПроцедуры	
 


  //Тютюн 25.03.25 перевірка наявності документів
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	
	Если НЕ Объект.ВидОплаты = ПредопределенноеЗначение("Перечисление.ВидыДенежныхСредств.Наличные") Тогда 
		Если ЗначениеЗаполнено(Объект.НомерВходящегоДокумента) Тогда
			Отказ = ПроверитьНаличиеДокументов(); 
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка) И НЕ Отказ И НЕ ПараметрыЗаписи.Свойство("НеЗадаватьВопрос") Тогда
			УпрощеннаяСхемаВизирования = ПроверитьНаличиеЗавизированныхДокументов();  
			Если УпрощеннаяСхемаВизирования Тогда  
				Отказ = Истина;
				ЗадатьВопрос();
			КонецЕсли;
		КонецЕсли;    
	КонецЕсли;
	
	ПроверкаОрганизации(Отказ);
КонецПроцедуры

Процедура ПроверкаОрганизации(Отказ)  
	
	Если ЗначениеЗаполнено(Объект.Подразделение) И ЗначениеЗаполнено(Объект.Организация) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоступностьОрганизацийДляПодразделений.Подразделение,
		|	ДоступностьОрганизацийДляПодразделений.Организация
		|ИЗ
		|	РегистрСведений.ДоступностьОрганизацийДляПодразделений КАК ДоступностьОрганизацийДляПодразделений
		|ГДЕ
		|	ДоступностьОрганизацийДляПодразделений.Подразделение = &Подразделение
		|	И ДоступностьОрганизацийДляПодразделений.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ Выборка.Следующий() Тогда 
			Отказ = Истина;
			Сообщить("Организация не соответствует подразделению!");
		КонецЕсли;     
	КонецЕсли;	
	
	
	//Проверим Статью	
	Если ЗначениеЗаполнено(Объект.СтатьяДвиженияДенежныхСредств) И ЗначениеЗаполнено(Объект.Организация) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоступностьОрганизацийДляСтатей.Организация
		|ИЗ
		|	РегистрСведений.ДоступностьОрганизацийДляСтатей КАК ДоступностьОрганизацийДляСтатей
		|ГДЕ
		|	ДоступностьОрганизацийДляСтатей.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		
		ВыборкаОрг = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаОрг.Следующий() Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДоступностьОрганизацийДляСтатей.Статья,
			|	ДоступностьОрганизацийДляСтатей.Организация
			|ИЗ
			|	РегистрСведений.ДоступностьОрганизацийДляСтатей КАК ДоступностьОрганизацийДляСтатей
			|ГДЕ
			|	ДоступностьОрганизацийДляСтатей.Статья = &Статья
			|	И ДоступностьОрганизацийДляСтатей.Организация = &Организация";
			
			Запрос.УстановитьПараметр("Организация", Объект.Организация);
			Запрос.УстановитьПараметр("Статья", Объект.СтатьяДвиженияДенежныхСредств);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если НЕ Выборка.Следующий() Тогда 
				Отказ = Истина;
				Сообщить("Организация не соответствует Статье!");
			КонецЕсли;   
			
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	//Вставити вміст обробника
КонецПроцедуры
 //Тютюн 20.02.25  
&НаСервере
Процедура ВидимостьФинАгента();  
	Если Объект.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("УТ-001096") ТОгда    
		Элементы.ГруппаФинАгенты.Видимость = Истина;
	Иначе 
		Элементы.ГруппаФинАгенты.Видимость = Ложь; 
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ВидимостьКассы();  
	Если Объект.ВидОперации = Перечисления.ВидыОперацийСчетНаОплатуПоставщику.Перемещение ТОгда    
		Элементы.ГруппаКассы.Видимость = Истина;
	Иначе 
		Элементы.ГруппаКассы.Видимость = Ложь; 
	КонецЕсли;
	КонецПроцедуры

&НаСервере
Процедура ДоступностьСуммыКОплате();    
	
	
	Если Объект.Автор = Пользователи.ТекущийПользователь() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
		|ГДЕ
		|	НЕ ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления
		|	И ЗаявкаНаРасходованиеДенежныхСредств.Проведен
		|	И ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			//  Возврат;
		КонецЕсли;
		
		Элементы.СуммаДокумента.Доступность = Истина;
		Элементы.СуммаДокумента.ТолькоПросмотр = Ложь;              
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
	Процедура ВидОперацииПриИзменении(Элемент)
		ВидимостьКассы();
	КонецПроцедуры

&НаСервере
	Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);  
		
	КонецПроцедуры 
	
	Процедура УстановитьДоступностьСуммы() 
		Если Значениезаполнено(Объект.ДоговорКонтрагента) Тогда 
			Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента.ОбщаяСуммаДоговора) Тогда  
				Элементы.СуммаСчета.ТолькоПросмотр = Истина;  
			Иначе
				Элементы.СуммаСчета.ТолькоПросмотр = Ложь; 
			КонецЕсли; 
			
		Иначе
			Элементы.СуммаСчета.ТолькоПросмотр = Ложь; 
		КонецЕсли; 

	КонецПроцедуры

&НаСервере
Процедура СуммаДокументаПриИзмененииНаСервере()
	Если Объект.СуммаСчета>0 Тогда
		Объект.ПроцентОплаты = Объект.СуммаДокумента/Объект.СуммаСчета*100;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
	Процедура СуммаДокументаПриИзменении(Элемент)
		СуммаДокументаПриИзмененииНаСервере();
	КонецПроцедуры


//КонецИзменений
